# OperatorType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterOperatorAndTextString..::..OperatorType Property
FilterOperatorAndTextString Class See Also
---
The filter operator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ScheduleFilterType OperatorType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OperatorType As ScheduleFilterType
	Get
```

Visual C++
---
```text
public:
property ScheduleFilterType OperatorType {
	ScheduleFilterType get ();
}
```

# See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace